# What is SQL

The full form is structured query language . It is a language designed for organising data in ralational databases .

It allows users to do a lot of functionalities 

- Data Creation

- Data Insertion 

- Data Querying 

- Data Updation 

- Deletion Data

# Data Querying

It is retrieving results from a database

# Demonstration in Python

There are many libraries in python that can help you perform SQL operations . Some of them are 


- sqlite 

- mysql -conncetor 

- Sql Alchemy

# Step 1 : Import the libraries

In [4]:
import sqlite3
import pandas as pd

/Users/rishi/opt/anaconda3/lib/python3.9/site-packages/pandas/core/computation/expressions.py:21: UserWarning: Pandas requires version '2.8.4' or newer of 'numexpr' (version '2.8.1' currently installed).
  from pandas.core.computation.check import NUMEXPR_INSTALLED
/Users/rishi/opt/anaconda3/lib/python3.9/site-packages/pandas/core/arrays/masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.4' currently installed).
  from pandas.core import (

# Step 2 : Create a connection to a Database

In [27]:
conn = sqlite3.connect('mydatabase.db') # Creating a database in the for m of a file 
#conn = sqlite3.connect(':memory:')
cursor = conn.cursor()

# Step 3 : Creating a Table

In [8]:
cursor.execute('''
CREATE TABLE Employees(
id INTEGER , 
name TEXT , 
age INTEGER,
position TEXT )
''')

In [10]:
conn.commit() ## Commin is required for assurity of action

# Step 4 - Insert Data into the table

In [15]:
cursor.execute('''
INSERT INTO Employees(id,name , age , position) VALUES 
(1, 'John Doe', 30 , 'Manager'), 
(2,'Jane Smith',25 , 'Analyst'),
(3,'Abhay Sharma',40,'Director')''')

In [16]:
conn.commit()

# Step 5 : Query the table

In [17]:
query = 'Select * from Employees'

In [18]:
df = pd.read_sql_query(query,conn)
df

   id          name  age  position
0   1      John Doe   30   Manager
1   2    Jane Smith   25   Analyst
2   3  Abhay Sharma   40  Director

# Step 6 : Updation of a Table

In [20]:
## Update the age of Jane from 25 to 40 

cursor.execute('''
UPDATE Employees SET age = 40 WHERE name = 'Jane Smith'
''')

conn.commit()

In [21]:
df = pd.read_sql_query(query,conn)
df

   id          name  age  position
0   1      John Doe   30   Manager
1   2    Jane Smith   40   Analyst
2   3  Abhay Sharma   40  Director

# Step 7 : Delete Entries from a Table

In [22]:
# Delete an Employee table record . Where name is John Doe 

cursor.execute('''
DELETE FROM Employees Where name = 'John Doe'
''')

conn.commit()

In [23]:
df = pd.read_sql_query(query,conn)
df

   id          name  age  position
0   2    Jane Smith   40   Analyst
1   3  Abhay Sharma   40  Director

In [25]:
import sqlite3
print(sqlite3.sqlite_version)

3.38.2